# Series

In [1]:
import pandas as pd

In [2]:
data=[1,2,3,4,5]
index=[0,1,2,3,4]

In [3]:
d=pd.Series(data,index)

In [4]:
d

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
#string
s=['a','b','c','d','e']
d=pd.Series(data,s)
d

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
#Dictionary
d={'a': 1,'b': 2,'c': 3,'d':4}
d_=pd.Series(d)

In [9]:
d_

a    1
b    2
c    3
d    4
dtype: int64

In [10]:
#ndarray
a=[[1,1,1],[2,2,2]]

In [11]:
a_=pd.Series(a)

In [12]:
a_

0    [1, 1, 1]
1    [2, 2, 2]
dtype: object

### Dataframes

In [13]:
### One or more dictionaries
d1={'a':1,'b':2,'c':3,'d':5}
d2={'a':"kiran",'b':"kumar",'c':'bullet','d':"datascientist"}
data={"apple":d1,"banana":d2}

In [15]:
d=pd.DataFrame(data)

In [16]:
d

   apple         banana
a      1          kiran
b      2          kumar
c      3         bullet
d      5  datascientist

In [20]:
### Data is Series
s1=pd.Series([1,2,3,4,5])
s2=pd.Series(['a',"b",'c','d','e'])
s3=pd.Series([22,33,55,44,66])
dta=pd.DataFrame({"ad": s1,"bd": s2,"cd": s3})

In [21]:
dta

   ad bd  cd
0   1  a  22
1   2  b  33
2   3  c  55
3   4  d  44
4   5  e  66

In [24]:
### Data is 2D-numpy ndarray
n1=[[1,2,3],[4,5,6]]
n2=[[22,3,22],[55,5,55]]
nd=pd.DataFrame({"1st":n1,"2nd":n2})

In [25]:
nd

         1st          2nd
0  [1, 2, 3]  [22, 3, 22]
1  [4, 5, 6]  [55, 5, 55]

# Read csv using pandas.read_csv()

In [26]:
import pandas as pd

In [27]:
data=pd.read_csv("nba.csv")

In [28]:
data

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
### Merge, Join and Concatenate DataFrames using Panda

In [30]:
import pandas as pd

In [32]:
data=pd.DataFrame({"a":[1,2,3,4,5],
                  "b":[6,7,8,9,0],
                  "c":[22,3,33,44,5]},index=[1,2,3,4,5])

In [34]:
data1=pd.DataFrame({"a":[22,2,2,2,2],
                  "b":[34,54,3,32,333],
                   "c":[22,3,33,44,5]},index=[6,7,8,9,0])

In [36]:
pd.concat([data,data1])

    a    b   c
1   1    6  22
2   2    7   3
3   3    8  33
4   4    9  44
5   5    0   5
6  22   34  22
7   2   54   3
8   2    3  33
9   2   32  44
0   2  333   5

In [37]:
### DataFrames Merge

In [40]:
data=pd.DataFrame({"a":[1,2,3,4,5],
                  "b":[6,7,8,9,0],
                  "c":[22,3,33,44,5]})

In [49]:
data1=pd.DataFrame({"s":[22,2,2,2,2],
                  "t":[34,54,3,32,333],
                   "c":[22,3,33,44,5]})

In [50]:
pd.merge(data,data1,how="inner",on="c")

   a  b   c   s    t
0  1  6  22  22   34
1  2  7   3   2   54
2  3  8  33   2    3
3  4  9  44   2   32
4  5  0   5   2  333

In [51]:
### DataFrames Join

In [52]:
data.merge(data1)

   a  b   c   s    t
0  1  6  22  22   34
1  2  7   3   2   54
2  3  8  33   2    3
3  4  9  44   2   32
4  5  0   5   2  333